<?php

return [
    // +----------------------------------------------------------------------
    // | URL设置
    // +----------------------------------------------------------------------
    
    // pathinfo分隔符
    'pathinfo_depr'          => '/',

	// +----------------------------------------------------------------------
    // | 模板设置
    // +----------------------------------------------------------------------

    'template'               => [
        // 模板引擎类型 支持 php think 支持扩展
        'type'         => 'think',
        // 模板路径
        'view_path'    => './template/default/',
        // 模板后缀
        'view_suffix'  => 'html',
        // 预先加载的标签库
        'taglib_pre_load'    =>    'app\common\taglib\Lz', 
    ],

    // 视图输出字符串内容替换
    'view_replace_str' => [
        '__PUBLIC__'=>'/public/',
        '__TEMPLATE__'=>'/template/default/',
        '__ROOT__' => '/',
    ]
];